In [80]:
import numpy as np
import pandas as pd
from numpy.random import rand

In [81]:
# Related data objects

# List 
L = [2, 3, 5, 7, 9, 11] 

# Dictionary
D = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000} 

# Structured array
SA = np.array([('Rex', 9, 81.0), ('Fido', 3, 27.0), ('Alice', 25, 55.0), ('Bob', 45, 85.5),
              ('Cathy', 37, 68.0), ('Doug', 19, 61.5)],
             dtype=[('name', 'U10'), ('age', 'i4'), ('weight', 'f4')]) 

# Two-dsimensional NumPy array
rand = np.random.RandomState(42)
TDA = rand.randint(20,100,(4,2)) 

# NumPy array
ND = np.array([[21],
[23],
[24],
[21]])


# Series
PS = pd.Series([59, 35, 69, 23], index=["a", "b", "c", "d"])

# Q1

In [82]:
print(L)
print(type(L))

[2, 3, 5, 7, 9, 11]
<class 'list'>

In [83]:
SL=pd.Series(L)
print(SL)
print(type(SL))

0     2
1     3
2     5
3     7
4     9
5    11
dtype: int64
<class 'pandas.core.series.Series'>

# Q2

In [84]:
print(D)

{'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [85]:
SD =pd.Series(D)
print(SD)
print(type(SD))

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64
<class 'pandas.core.series.Series'>

In [86]:
SD['California']=45000
print(SD)

Ohio          35000
Texas         71000
Oregon        16000
Utah           5000
California    45000
dtype: int64

In [87]:
SD['Ohio' : 'Oregon']

Ohio      35000
Texas     71000
Oregon    16000
dtype: int64

# Q3

In [88]:
print(SA)

[('Rex',  9, 81. ) ('Fido',  3, 27. ) ('Alice', 25, 55. )
 ('Bob', 45, 85.5) ('Cathy', 37, 68. ) ('Doug', 19, 61.5)]

In [89]:
DF=pd.DataFrame(SA)
print(DF)

    name  age  weight
0    Rex    9    81.0
1   Fido    3    27.0
2  Alice   25    55.0
3    Bob   45    85.5
4  Cathy   37    68.0
5   Doug   19    61.5

# Q4

In [90]:
print(TDA)
print(type(TDA))

[[71 34]
 [91 80]
 [40 94]
 [94 43]]
<class 'numpy.ndarray'>

In [91]:
df2=pd.DataFrame(TDA)
print(df2)

    0   1
0  71  34
1  91  80
2  40  94
3  94  43

In [92]:
df2 = pd.DataFrame(TDA, columns=['foo','bar'],index=['a','b','c','c'])
print(df2)

   foo  bar
a   71   34
b   91   80
c   40   94
c   94   43

In [93]:
ND = np.array([[21],
[23],
[24],
[21]])

print(ND)

[[21]
 [23]
 [24]
 [21]]

In [94]:
df2['age']=ND
print(df2)

   foo  bar  age
a   71   34   21
b   91   80   23
c   40   94   24
c   94   43   21

# Q5

In [95]:
print(PS)

a    59
b    35
c    69
d    23
dtype: int64

In [96]:
PS['a':'b']

a    59
b    35
dtype: int64

In [97]:
PS[2:4]

c    69
d    23
dtype: int64

In [98]:
PS[::2]

a    59
c    69
dtype: int64

In [99]:
PS[(PS>30)&(PS<60)]

a    59
b    35
dtype: int64

# Q6

In [100]:
I01=pd.Index(['a','b','c','d'])
print(I01)

Index(['a', 'b', 'c', 'd'], dtype='object')

In [101]:
I02=pd.Index(['a','c','e','g'])
print(I02)

Index(['a', 'c', 'e', 'g'], dtype='object')

In [102]:
I01.intersection(I02)

Index(['a', 'c'], dtype='object')

In [103]:
I01.union(I02)

Index(['a', 'b', 'c', 'd', 'e', 'g'], dtype='object')

In [104]:
I01.symmetric_difference(I02)

Index(['b', 'd', 'e', 'g'], dtype='object')

# Q7

In [105]:
print(df2)

   foo  bar  age
a   71   34   21
b   91   80   23
c   40   94   24
c   94   43   21

In [106]:
df2.loc['a','foo']

71

In [107]:
df2.loc['a':'b','foo':'bar']

   foo  bar
a   71   34
b   91   80

In [108]:
df2.iloc[0,0]

71

In [109]:
df2.iloc[:2,:2]

   foo  bar
a   71   34
b   91   80

In [110]:
df2.iloc[::2,::2]

   foo  age
a   71   21
c   40   24

# Q8

In [111]:
area = pd.Series({'California': 423967, 
             'Texas': 695662, 
             'New York': 141297,
             'Florida': 170312, 
             'Illinois': 149995})

In [112]:
population = pd.Series({'California': 38332521,
                    'Texas': 26448193,
                    'New York': 19651127,
                    'Florida': 19552860,
                    'Illinois': 12882135})

In [113]:
df3 = pd.DataFrame({'area':area,'population':population})
print(df3)

              area  population
California  423967    38332521
Texas       695662    26448193
New York    141297    19651127
Florida     170312    19552860
Illinois    149995    12882135

In [114]:
df3['density']=population/area
print(df3)

              area  population     density
California  423967    38332521   90.413926
Texas       695662    26448193   38.018740
New York    141297    19651127  139.076746
Florida     170312    19552860  114.806121
Illinois    149995    12882135   85.883763

In [115]:
df3.T

,California,Texas,New York,Florida,Illinois
area,4.239670e+05,6.956620e+05,1.412970e+05,1.703120e+05,1.499950e+05
population,3.833252e+07,2.644819e+07,1.965113e+07,1.955286e+07,1.288214e+07
density,9.041393e+01,3.801874e+01,1.390767e+02,1.148061e+02,8.588376e+01

In [116]:
df3.loc[df3.density<100,['population','density']]

            population    density
California    38332521  90.413926
Texas         26448193  38.018740
Illinois      12882135  85.883763

# Q9

In [117]:
IS1 = pd.Series([2, 4, 6, 8,10], index=[0, 1, 2, 3, 4])
IS2 = pd.Series([1, 3, 5, 7,9], index=[1, 2, 3, 4, 5])

In [118]:
IS1+IS2

0     NaN
1     5.0
2     9.0
3    13.0
4    17.0
5     NaN
dtype: float64

In [119]:
IS1.add(IS2,fill_value=0)

0     2.0
1     5.0
2     9.0
3    13.0
4    17.0
5     9.0
dtype: float64

# Q10

In [120]:
IS3 = pd.DataFrame([[1, 2],[3, 4]], columns=list('AB'))
IS4 = pd.DataFrame([[1, 2, 3], [4, 5, 6], [7, 8, 9]], columns=list('BAC'))

In [121]:
print(IS3)
print(IS4)

   A  B
0  1  2
1  3  4
   B  A  C
0  1  2  3
1  4  5  6
2  7  8  9

In [122]:
IS3+IS4

     A    B   C
0  3.0  3.0 NaN
1  8.0  8.0 NaN
2  NaN  NaN NaN

In [123]:
IS3.stack().mean()

2.5

In [124]:
IS3.add(IS4,fill_value=IS3.stack().mean())

      A    B     C
0   3.0  3.0   5.5
1   8.0  8.0   8.5
2  10.5  9.5  11.5